[
  {
    "tipo": "titulo",
    "nome": "PARTE GERAL",
    "filhos": [
      {
        "tipo": "titulo",
        "nome": "DA APLICAÇÃO DA LEI PENAL",
        "filhos": [
          {
            "tipo": "principio",
            "nome": "Anterioridade da Lei",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 1º - Não há crime sem lei anterior que o defina. Não há pena sem prévia cominação legal",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Lei penal no tempo",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 2º - Ninguém pode ser punido por fato que lei posterior deixa de considerar crime, cessando em virtude dela a execução e os efeitos penais da sentença condenatória.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Lei excepcional ou temporária",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 3º - A lei excepcional ou temporária, embora decorrido o período de sua duração ou cessadas as circunstâncias que a determinaram, aplica-se ao fato praticado durante sua vigência.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Tempo do crime",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 4º - Considera-se praticado o crime no momento da ação ou omissão, ainda que outro seja o momento do resultado.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Territorialidade",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 5º - Aplica-se a lei brasileira, sem prejuízo de convenções, tratados e regras de direito internacional, ao crime cometido no território nacional.    § 1º - Para os efeitos penais, consideram-se como extensão do território nacional as embarcações e aeronaves brasileiras, de natureza pública ou a serviço do governo brasileiro onde quer que se encontrem, bem como as aeronaves e as embarcações brasileiras, mercantes ou de propriedade privada, que se achem, respectivamente, no espaço aéreo correspondente ou em alto-mar.     § 2º - É também aplicável a lei brasileira aos crimes praticados a bordo de aeronaves ou embarcações estrangeiras de propriedade privada, achando-se aquelas em pouso no território nacional ou em vôo no espaço aéreo correspondente, e estas em porto ou mar territorial do Brasil.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Lugar do crime",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 6º - Considera-se praticado o crime no lugar em que ocorreu a ação ou omissão, no todo ou em parte, bem como onde se produziu ou deveria produzir-se o resultado.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Extraterritorialidade",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 7º - Ficam sujeitos à lei brasileira, embora cometidos no estrangeiro:         I - os crimes:         a) contra a vida ou a liberdade do Presidente da República;         b) contra o patrimônio ou a fé pública da União, do Distrito Federal, de Estado, de Território, de Município, de empresa pública, sociedade de economia mista, autarquia ou fundação instituída pelo Poder Público;         c) contra a administração pública, por quem está a seu serviço;         d) de genocídio, quando o agente for brasileiro ou domiciliado no Brasil;         II - os crimes:          a) que, por tratado ou convenção, o Brasil se obrigou a reprimir;         b) praticados por brasileiro;         c) praticados em aeronaves ou embarcações brasileiras, mercantes ou de propriedade privada, quando em território estrangeiro e aí não sejam julgados.         § 1º - Nos casos do inciso I, o agente é punido segundo a lei brasileira, ainda que absolvido ou condenado no estrangeiro.        § 2º - Nos casos do inciso II, a aplicação da lei brasileira depende do concurso das seguintes condições:         a) entrar o agente no território nacional;         b) ser o fato punível também no país em que foi praticado;         c) estar o crime incluído entre aqueles pelos quais a lei brasileira autoriza a extradição;         d) não ter sido o agente absolvido no estrangeiro ou não ter aí cumprido a pena;         e) não ter sido o agente perdoado no estrangeiro ou, por outro motivo, não estar extinta a punibilidade, segundo a lei mais favorável.         § 3º - A lei brasileira aplica-se também ao crime cometido por estrangeiro contra brasileiro fora do Brasil, se, reunidas as condições previstas no parágrafo anterior:         a) não foi pedida ou foi negada a extradição;         b) houve requisição do Ministro da Justiça.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Pena cumprida no estrangeiro",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 8º - A pena cumprida no estrangeiro atenua a pena imposta no Brasil pelo mesmo crime, quando diversas, ou nela é computada, quando idênticas.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Eficácia de sentença estrangeira",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 9º - A sentença estrangeira, quando a aplicação da lei brasileira produz na espécie as mesmas conseqüências, pode ser homologada no Brasil para:         I - obrigar o condenado à reparação do dano, a restituições e a outros efeitos civis;           II - sujeitá-lo a medida de segurança.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Parágrafo único",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "A homologação depende:         a) para os efeitos previstos no inciso I, de pedido da parte interessada;         b) para os outros efeitos, da existência de tratado de extradição com o país de cuja autoridade judiciária emanou a sentença, ou, na falta de tratado, de requisição do Ministro da Justiça.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Contagem de prazo",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 10 - O dia do começo inclui-se no cômputo do prazo. Contam-se os dias, os meses e os anos pelo calendário comum.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Frações não computáveis da pena",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 11 - Desprezam-se, nas penas privativas de liberdade e nas restritivas de direitos, as frações de dia, e, na pena de multa, as frações de cruzeiro.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Legislação especial",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 12 - As regras gerais deste Código aplicam-se aos fatos incriminados por lei especial, se esta não dispuser de modo diverso.",
                "filhos": []
              }
            ]
          }
        ]
      },
      {
        "tipo": "titulo",
        "nome": "DO CRIME",
        "filhos": [
          {
            "tipo": "principio",
            "nome": "Relação de causalidade",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 13 - O resultado, de que depende a existência do crime, somente é imputável a quem lhe deu causa. Considera-se causa a ação ou omissão sem a qual o resultado não teria ocorrido.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Superveniência de causa independente",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 13,   § 1º - A superveniência de causa relativamente independente exclui a imputação quando, por si só, produziu o resultado; os fatos anteriores, entretanto, imputam-se a quem os praticou. ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Relevância da omissão",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 13,  § 2º - A omissão é penalmente relevante quando o omitente devia e podia agir para evitar o resultado. O dever de agir incumbe a quem:        a) tenha por lei obrigação de cuidado, proteção ou vigilância;         b) de outra forma, assumiu a responsabilidade de impedir o resultado;        c) com seu comportamento anterior, criou o risco da ocorrência do resultado.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Crime consumado",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 14 - Diz-se o crime:         I - consumado, quando nele se reúnem todos os elementos de sua definição legal; ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Tentativa",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 14 - Diz-se o crime:        II - tentado, quando, iniciada a execução, não se consuma por circunstâncias alheias à vontade do agente. ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Pena de tentativa",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 14, Parágrafo único - Salvo disposição em contrário, pune-se a tentativa com a pena correspondente ao crime consumado, diminuída de um a dois terços.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Desistência voluntária e arrependimento eficaz",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 15 - O agente que, voluntariamente, desiste de prosseguir na execução ou impede que o resultado se produza, só responde pelos atos já praticados.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Arrependimento posterior",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 16 - Nos crimes cometidos sem violência ou grave ameaça à pessoa, reparado o dano ou restituída a coisa, até o recebimento da denúncia ou da queixa, por ato voluntário do agente, a pena será reduzida de um a dois terços.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Crime impossível",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": " Art. 17 - Não se pune a tentativa quando, por ineficácia absoluta do meio ou por absoluta impropriedade do objeto, é impossível consumar-se o crime.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Crime doloso",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 18 - Diz-se o crime:        I - doloso, quando o agente quis o resultado ou assumiu o risco de produzi-lo;",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Crime culposo",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 18 - Diz-se o crime:         II - culposo, quando o agente deu causa ao resultado por imprudência, negligência ou imperícia.        Parágrafo único - Salvo os casos expressos em lei, ninguém pode ser punido por fato previsto como crime, senão quando o pratica dolosamente.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Agravação pelo resultado",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 19 - Pelo resultado que agrava especialmente a pena, só responde o agente que o houver causado ao menos culposamente.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Erro sobre elementos do tipo",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 20 - O erro sobre elemento constitutivo do tipo legal de crime exclui o dolo, mas permite a punição por crime culposo, se previsto em lei.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Descriminantes putativas",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 20,   § 1º - É isento de pena quem, por erro plenamente justificado pelas circunstâncias, supõe situação de fato que, se existisse, tornaria a ação legítima. Não há isenção de pena quando o erro deriva de culpa e o fato é punível como crime culposo.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Erro determinado por terceiro",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 20,    § 2º - Responde pelo crime o terceiro que determina o erro.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "  Erro sobre a pessoa",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Aet. 20,   § 3º - O erro quanto à pessoa contra a qual o crime é praticado não isenta de pena. Não se consideram, neste caso, as condições ou qualidades da vítima, senão as da pessoa contra quem o agente queria praticar o crime. ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Erro sobre a ilicitude do fato",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 21 - O desconhecimento da lei é inescusável. O erro sobre a ilicitude do fato, se inevitável, isenta de pena; se evitável, poderá diminuí-la de um sexto a um terço.         Parágrafo único - Considera-se evitável o erro se o agente atua ou se omite sem a consciência da ilicitude do fato, quando lhe era possível, nas circunstâncias, ter ou atingir essa consciência. ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Coação irresistível e obediência hierárquica",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 22 - Se o fato é cometido sob coação irresistível ou em estrita obediência a ordem, não manifestamente ilegal, de superior hierárquico, só é punível o autor da coação ou da ordem.  ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Exclusão de ilicitude",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 23 - Não há crime quando o agente pratica o fato:        I - em estado de necessidade;        II - em legítima defesa;        III - em estrito cumprimento de dever legal ou no exercício regular de direito.   ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Excesso punível",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Parágrafo único - O agente, em qualquer das hipóteses deste artigo, responderá pelo excesso doloso ou culposo.  ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Estado de necessidade",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 24 - Considera-se em estado de necessidade quem pratica o fato para salvar de perigo atual, que não provocou por sua vontade, nem podia de outro modo evitar, direito próprio ou alheio, cujo sacrifício, nas circunstâncias, não era razoável exigir-se.        § 1º - Não pode alegar estado de necessidade quem tinha o dever legal de enfrentar o perigo.         § 2º - Embora seja razoável exigir-se o sacrifício do direito ameaçado, a pena poderá ser reduzida de um a dois terços.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Legítima defesa",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 25 - Entende-se em legítima defesa quem, usando moderadamente dos meios necessários, repele injusta agressão, atual ou iminente, a direito seu ou de outrem.         Parágrafo único. Observados os requisitos previstos no caput deste artigo, considera-se também em legítima defesa o agente de segurança pública que repele agressão ou risco de agressão a vítima mantida refém durante a prática de crimes.      ",
                "filhos": []
              }
            ]
          }
        ]
      },
      {
        "tipo": "titulo",
        "nome": "DA IMPUTABILIDADE PENAL",
        "filhos": []
      },
      {
        "tipo": "titulo",
        "nome": "DO CONCURSO DE PESSOAS",
        "filhos": []
      },
      {
        "tipo": "titulo",
        "nome": "DAS PENAS",
        "filhos": []
      },
      {
        "tipo": "titulo",
        "nome": "DAS MEDIDAS DE SEGURANÇA",
        "filhos": []
      },
      {
        "tipo": "titulo",
        "nome": "DA AÇÃO PENAL",
        "filhos": []
      },
      {
        "tipo": "titulo",
        "nome": "DA EXTINÇÃO DA PUNIBILIDADE",
        "filhos": []
      }
    ]
  },
  {
    "tipo": "titulo",
    "nome": "PARTE ESPECIAL",
    "filhos": []
  }
]